WikDra/esp-idf-wifi-repeater/sdkconfig.defaults
# ESP32-C6 WiFi 6 Repeater - sdkconfig defaults
CONFIG_IDF_TARGET="esp32c6"

# WiFi 6 (802.11ax / HE) - C6 has native HE support via SOC_WIFI_HE_SUPPORT
CONFIG_SOC_WIFI_HE_SUPPORT=y

# WiFi general
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y

# Network
CONFIG_ESP_NETIF_TCPIP_LWIP=y
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=n

# lwIP tuning
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# System
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=160

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
